---
kind: method
id: M:Autodesk.Revit.DB.FilterableValueProvider.GetStringValue(Autodesk.Revit.DB.Element)
source: html/c96649ba-c1cd-335e-1923-ac1af3f366bf.htm
---
# Autodesk.Revit.DB.FilterableValueProvider.GetStringValue Method

Gets a string value from the given element.

## Syntax (C#)
```csharp
public string GetStringValue(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to query.

## Returns
The string value from the element.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null